app/views/user/index.html.erb

SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = $1 LIMIT 1  [["user_id", 1]]
---
                               <div class="profile-name text-center">
                                   <h4>Hello, <span class="text-primary"><%= current_user.user_info.firstname.titleize %></span></h4>