app/controllers/inventories_controller.rb

  def show

    total = 0
    inventory = Inventory.all
    @result_inventory = inventory.joins(:on_stocks, :inventory_stocks)
---
SELECT "inventories".* FROM "inventories"
SELECT "inventories".* FROM "inventories" INNER JOIN "inventory_stocks" ON "inventory_stocks"."inventory_id" = "inventories"."id" INNER JOIN "inventory_stocks" "inventory_stocks_inventories_join" ON "inventory_stocks_inventories_join"."inventory_id" = "inventories"."id" INNER JOIN "on_stocks" ON "on_stocks"."id" = "inventory_stocks_inventories_join"."on_stock_id"
SELECT "inventory_stocks".* FROM "inventory_stocks" INNER JOIN "on_stocks" ON "on_stocks"."id" = "inventory_stocks"."on_stock_id" INNER JOIN "inventories" ON "inventories"."id" = "inventory_stocks"."inventory_id"

  def submitStock
    @inventory = Inventory.create(inventory_params)
    inventory_data = Inventory.last


    @onstock = OnStock.create(product_type: params[:product_type], category_id: inventory_data.category_id, inventory_id: inventory_data.id)

    stock_last = OnStock.last

    @inventoryStock = InventoryStock.create(inventory_id: inventory_data.id, on_stock_id: stock_last.id)
---
INSERT INTO "inventories" ("category_id", "product_name", "product_details", "price", "quantity", "transaction_date", "product_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "inventories".* FROM "inventories"  ORDER BY "inventories"."id" DESC LIMIT 1
INSERT INTO "on_stocks" ("product_type", "category_id", "inventory_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_type", "Retail"], ["category_id", 1], ["inventory_id", 67], ["created_at", "2015-07-03 06:48:48.147052"], ["updated_at", "2015-07-03 06:48:48.147052"]]
SELECT  "on_stocks".* FROM "on_stocks"  ORDER BY "on_stocks"."id" DESC LIMIT 1
INSERT INTO "inventory_stocks" ("inventory_id", "on_stock_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["inventory_id", 71], ["on_stock_id", 13], ["created_at", "2015-07-03 08:56:00.293807"], ["updated_at", "2015-07-03 08:56:00.293807"]]